Ran Plan for 3 projects:

1. dir: `gcp/projects/jonpulsifer` workspace: `default`
1. dir: `gcp/projects/trusted-builds` workspace: `default`
1. dir: `gcp/projects/wishlist-4362e` workspace: `default`

### 1. dir: `gcp/projects/jonpulsifer` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/jonpulsifer/cloudlab/14/default/gcp/projects/jonpulsifer/default.tfplan\"" in "/home/atlantis/.atlantis/repos/jonpulsifer/cloudlab/14/default/gcp/projects/jonpulsifer": exit status 1
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.google_iam_policy.explicit: Refreshing state...
google_sourcerepo_repository.dotfiles: Refreshing state... [id=jonpulsifer/dotfiles]
google_project_service.project: Refreshing state... [id=jonpulsifer/sourcerepo.googleapis.com]
data.google_iam_policy.gcs-jonpulsifer: Refreshing state...
data.google_client_config.current: Refreshing state...
google_storage_bucket.jonpulsifer: Refreshing state... [id=jonpulsifer]
google_project_iam_policy.explicit: Refreshing state... [id=jonpulsifer]
google_storage_bucket_iam_policy.gcs-jonpulsifer: Refreshing state... [id=jonpulsifer]

Error: Error reading Project Service jonpulsifer/sourcerepo.googleapis.com: Request "List Project Services jonpulsifer" returned error: Failed to list enabled services for project jonpulsifer: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



```
</details>

---
### 2. dir: `gcp/projects/trusted-builds` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/jonpulsifer/cloudlab/14/default/gcp/projects/trusted-builds/default.tfplan\"" in "/home/atlantis/.atlantis/repos/jonpulsifer/cloudlab/14/default/gcp/projects/trusted-builds": exit status 1
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_project_service.service["oslogin.googleapis.com"]: Refreshing state... [id=trusted-builds/oslogin.googleapis.com]
google_project_service.service["monitoring.googleapis.com"]: Refreshing state... [id=trusted-builds/monitoring.googleapis.com]
data.google_project.trusted-builds: Refreshing state...
google_service_account.builder: Refreshing state... [id=projects/trusted-builds/serviceAccounts/builder@trusted-builds.iam.gserviceaccount.com]
module.network.google_compute_network.network: Refreshing state... [id=builds]
module.network.data.google_client_config.current: Refreshing state...
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=trusted-builds/cloudbuild.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=trusted-builds/containerregistry.googleapis.com]
google_project_service.service["servicemanagement.googleapis.com"]: Refreshing state... [id=trusted-builds/servicemanagement.googleapis.com]
google_project_service.service["logging.googleapis.com"]: Refreshing state... [id=trusted-builds/logging.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=trusted-builds/serviceusage.googleapis.com]
google_project_service.service["storage-component.googleapis.com"]: Refreshing state... [id=trusted-builds/storage-component.googleapis.com]
google_project_service.service["pubsub.googleapis.com"]: Refreshing state... [id=trusted-builds/pubsub.googleapis.com]
google_project_service.service["sourcerepo.googleapis.com"]: Refreshing state... [id=trusted-builds/sourcerepo.googleapis.com]
google_project_service.service["storage-api.googleapis.com"]: Refreshing state... [id=trusted-builds/storage-api.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=trusted-builds/compute.googleapis.com]
module.network.google_compute_subnetwork.vms: Refreshing state... [id=northamerica-northeast1/vms]
data.google_iam_policy.explicit: Refreshing state...
google_project_iam_policy.explicit: Refreshing state... [id=trusted-builds]

Error: Error reading Project Service trusted-builds/pubsub.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/storage-api.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/compute.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/sourcerepo.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/oslogin.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/monitoring.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/cloudbuild.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/serviceusage.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/storage-component.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/logging.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/containerregistry.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



Error: Error reading Project Service trusted-builds/servicemanagement.googleapis.com: Request "List Project Services trusted-builds" returned error: Batch request and retried single request "List Project Services trusted-builds" both failed. Final error: Failed to list enabled services for project trusted-builds: googleapi: Error 403: Service Usage API has not been used in project 798779835577 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=798779835577 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry., accessNotConfigured



```
</details>

---
### 3. dir: `gcp/projects/wishlist-4362e` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_dns_managed_zone.wishlist-app will be created
+ resource "google_dns_managed_zone" "wishlist-app" {
      + description  = "Domain for the wishlist app"
      + dns_name     = "wishin.app."
      + id           = (known after apply)
      + labels       = {
          + "domain"      = "wishlist-app"
          + "environment" = "production"
        }
      + name         = "wishlist-app"
      + name_servers = (known after apply)
      + project      = (known after apply)
      + visibility   = "public"
    }

  # google_project_iam_member.cert-manager will be created
+ resource "google_project_iam_member" "cert-manager" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cert-manager@kubesec.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/dns.admin"
    }

  # google_project_iam_member.external-dns will be created
+ resource "google_project_iam_member" "external-dns" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:external-dns@kubesec.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/dns.admin"
    }

  # google_project_organization_policy.allow_production_services will be created
+ resource "google_project_organization_policy" "allow_production_services" {
      + constraint  = "serviceuser.services"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "wishlist-4362e"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all = true
            }
        }
    }

  # google_project_organization_policy.allow_service_accounts will be created
+ resource "google_project_organization_policy" "allow_service_accounts" {
      + constraint  = "iam.disableServiceAccountCreation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "wishlist-4362e"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = false
        }
    }

  # google_project_service.clouddns will be created
+ resource "google_project_service" "clouddns" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "dns.googleapis.com"
    }

  # google_service_account.wishlist will be created
+ resource "google_service_account" "wishlist" {
      + account_id   = "wishlist"
      + display_name = "Application service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.wishlist-workload-identity will be created
+ resource "google_service_account_iam_member" "wishlist-workload-identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:kubesec.svc.id.goog[wishlist/wishlist]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---

